Masmiseim36/nxpSDK/middleware/wireless/ieee_802_15_4_5.3.5/phy/source/MKW41Z/ASP.c
    return status;
}

/*! *********************************************************************************
* \brief  Send a raw data frame OTA
*
* \param[in]  dataPtr  raw data
*
* \return  AspStatus_t
*
********************************************************************************** */
AspStatus_t ASP_TelecSendRawData(uint8_t* dataPtr)
{
    AspStatus_t status = gAspSuccess_c;
        
    /* Validate the length */
    if((dataPtr[0] + 2) > gMaxPHYPacketSize_c)
    {
        status = gAspTooLong_c;
    }
    else
    {
        /* Force Idle */
        PhyPlmeForceTrxOffRequest();
        XCVR_TX_DIG->CTRL &= ~XCVR_TX_DIG_CTRL_RADIO_DFT_MODE_MASK;
        ZLL->SEQ_CTRL_STS &= ~ZLL_SEQ_CTRL_STS_CONTINUOUS_EN_MASK;
        
        /* Load the TX PB: load the PSDU Lenght byte but not the FCS bytes */
        FLib_MemCpy( (void*)ZLL->PKT_BUFFER_TX, dataPtr, dataPtr[0] + 1);
        /* Add FCS length to PSDU Length*/
        *((uint8_t*)ZLL->PKT_BUFFER_TX) = dataPtr[0] + 2;
        /* Program a Tx sequence */
        ZLL->PHY_CTRL |= ZLL_PHY_CTRL_XCVSEQ(gTX_c);
    }
    
    return status;
}

/*! *********************************************************************************
* \brief  Set Telec test mode
*
* \param[in]  mode  Telec test mode
*
* \return  AspStatus_t
*
********************************************************************************** */
AspStatus_t ASP_TelecTest(uint8_t mode)
{
    uint8_t channel;
    AspStatus_t status = gAspSuccess_c;
    static bool_t fracSet = FALSE;

    /* Get current channel number */
    channel = PhyPlmeGetCurrentChannelRequest(0);

    if( fracSet )
    {
        ASP_TelecSetFreq(channel);
        fracSet = FALSE;
    }

    switch( mode )
    {
    case gTestForceIdle_c:  /* ForceIdle() */
        /* Stop Tx interval timer (if started) */
        PhyTime_CancelEvent(mAsp_TxTimer);
#ifdef gSmacSupported
        MLMEPhySoftReset();
#else
        PhyPlmeForceTrxOffRequest();
#endif
        XCVR_TX_DIG->CTRL &= ~(XCVR_TX_DIG_CTRL_TX_DFT_EN_MASK | 
                               XCVR_TX_DIG_CTRL_LFSR_EN_MASK | 
                               XCVR_TX_DIG_CTRL_RADIO_DFT_MODE_MASK);
        XCVR_TSM->CTRL &= ~XCVR_TSM_CTRL_FORCE_TX_EN_MASK;
        XCVR_MISC->DTEST_CTRL &= ~XCVR_CTRL_DTEST_CTRL_DTEST_EN_MASK;
        ZLL->SEQ_CTRL_STS &= ~ZLL_SEQ_CTRL_STS_CONTINUOUS_EN_MASK;
        break;

    case gTestPulseTxPrbs9_c:  /* Continuously transmit a PRBS9 pattern. */
        XCVR_TX_DIG->CTRL &= ~XCVR_TX_DIG_CTRL_RADIO_DFT_MODE_MASK;
        ASP_PRBS9_Load(); /* Load the TX RAM */
        /* Enable continuous TX mode */
        ZLL->SEQ_CTRL_STS |= ZLL_SEQ_CTRL_STS_CONTINUOUS_EN_MASK;
        ZLL->PHY_CTRL |= ZLL_PHY_CTRL_XCVSEQ(gTX_c);
        break;

    case gTestContinuousRx_c:  /* Sets the device into continuous RX mode */
        XCVR_TX_DIG->CTRL &= ~XCVR_TX_DIG_CTRL_RADIO_DFT_MODE_MASK;
        /* Set length of data in DUAL_PAN_DWELL register */
        ZLL->DUAL_PAN_CTRL &= ~ZLL_DUAL_PAN_CTRL_DUAL_PAN_DWELL_MASK;
        ZLL->DUAL_PAN_CTRL |= ZLL_DUAL_PAN_CTRL_DUAL_PAN_DWELL(127);
        /* Enable continuous RX mode */
        ZLL->SEQ_CTRL_STS |= ZLL_SEQ_CTRL_STS_CONTINUOUS_EN_MASK;
        ZLL->PHY_CTRL |= ZLL_PHY_CTRL_XCVSEQ(gRX_c);
        break;

    case gTestContinuousTxMod_c:  /* Sets the device to continuously transmit a 10101010 pattern */
        XCVR_TX_DIG->CTRL &= ~(XCVR_TX_DIG_CTRL_DFT_CLK_SEL_MASK |
                               XCVR_TX_DIG_CTRL_RADIO_DFT_MODE_MASK);
        XCVR_TX_DIG->CTRL |= XCVR_TX_DIG_CTRL_RADIO_DFT_MODE(gDftTxPattern_c) |
                             XCVR_TX_DIG_CTRL_TX_DFT_EN_MASK;
        XCVR_TX_DIG->DFT_PATTERN = 0xAAAAAAAAU;
        XCVR_MISC->DTEST_CTRL |= XCVR_CTRL_DTEST_CTRL_DTEST_EN_MASK;
        XCVR_TSM->CTRL |= XCVR_TSM_CTRL_FORCE_TX_EN_MASK;
        break;

    case gTestContinuousTxNoMod_c: /* Sets the device to continuously transmit an unmodulated CW */
        XCVR_TX_DIG->CTRL &= ~(XCVR_TX_DIG_CTRL_DFT_CLK_SEL_MASK |
                               XCVR_TX_DIG_CTRL_RADIO_DFT_MODE_MASK);
        XCVR_TX_DIG->CTRL |= XCVR_TX_DIG_CTRL_RADIO_DFT_MODE(gDftTxNoMod_Carrier_c);
        XCVR_MISC->DTEST_CTRL |= XCVR_CTRL_DTEST_CTRL_DTEST_EN_MASK;
        XCVR_TSM->CTRL |= XCVR_TSM_CTRL_FORCE_TX_EN_MASK;
        fracSet = TRUE;
        break;

    case gTestContinuousTx1MbpsPRBS9_c:
        XCVR_TX_DIG->CTRL &= ~(XCVR_TX_DIG_CTRL_DFT_CLK_SEL_MASK |
                               XCVR_TX_DIG_CTRL_RADIO_DFT_MODE_MASK |
                               XCVR_TX_DIG_CTRL_LFSR_LENGTH_MASK);
        XCVR_TX_DIG->CTRL |= XCVR_TX_DIG_CTRL_RADIO_DFT_MODE(gDftTxPnChipData_c) |
                             XCVR_TX_DIG_CTRL_LFSR_LENGTH(0) | /* length 9 */
                             XCVR_TX_DIG_CTRL_LFSR_EN_MASK;
        XCVR_MISC->DTEST_CTRL |= XCVR_CTRL_DTEST_CTRL_DTEST_EN_MASK;
        XCVR_TSM->CTRL |= XCVR_TSM_CTRL_FORCE_TX_EN_MASK;
        break;

    case gTestContinuousTxExternalSrc_c:
        XCVR_TX_DIG->CTRL &= ~(XCVR_TX_DIG_CTRL_DFT_CLK_SEL_MASK |
                               XCVR_TX_DIG_CTRL_RADIO_DFT_MODE_MASK);
        XCVR_TX_DIG->CTRL |= XCVR_TX_DIG_CTRL_RADIO_DFT_MODE(gDftTxExternalSrc_c);
        XCVR_MISC->DTEST_CTRL |= XCVR_CTRL_DTEST_CTRL_DTEST_EN_MASK;
        XCVR_TSM->CTRL |= XCVR_TSM_CTRL_FORCE_TX_EN_MASK;
        break;

    case gTestContinuousTxModZero_c:
        XCVR_TX_DIG->CTRL &= ~(XCVR_TX_DIG_CTRL_DFT_CLK_SEL_MASK |
                               XCVR_TX_DIG_CTRL_RADIO_DFT_MODE_MASK);
        XCVR_TX_DIG->CTRL |= XCVR_TX_DIG_CTRL_RADIO_DFT_MODE(gDftTxPattern_c) |
                             XCVR_TX_DIG_CTRL_TX_DFT_EN_MASK;
        XCVR_TX_DIG->DFT_PATTERN = 0x00000000;
        XCVR_MISC->DTEST_CTRL |= XCVR_CTRL_DTEST_CTRL_DTEST_EN_MASK;
        XCVR_TSM->CTRL |= XCVR_TSM_CTRL_FORCE_TX_EN_MASK;
        break;

    case gTestContinuousTxModOne_c:
        XCVR_TX_DIG->CTRL &= ~(XCVR_TX_DIG_CTRL_DFT_CLK_SEL_MASK |
                               XCVR_TX_DIG_CTRL_RADIO_DFT_MODE_MASK);
        XCVR_TX_DIG->CTRL |= XCVR_TX_DIG_CTRL_RADIO_DFT_MODE(gDftTxPattern_c) |
                             XCVR_TX_DIG_CTRL_TX_DFT_EN_MASK;
        XCVR_TX_DIG->DFT_PATTERN = 0xFFFFFFFFU;
        XCVR_MISC->DTEST_CTRL |= XCVR_CTRL_DTEST_CTRL_DTEST_EN_MASK;
        XCVR_TSM->CTRL |= XCVR_TSM_CTRL_FORCE_TX_EN_MASK;
        break;

    case gTestTxPacketPRBS9_c:
        ASP_TxInterval( (uint32_t)mAsp_Prbs9Packet );
        break;
        
    default:
        status = gAspInvalidParameter_c;
        break;
    }

