Masmiseim36/nxpSDK/middleware/wireless/ieee_802_15_4_5.3.5/phy/source/MKW41Z/ASP.c
    return status;
}

/*! *********************************************************************************
* \brief  Transmit a raw data packet at a specific interval
*
* \param[in]  address of the raw data packet
*
********************************************************************************** */
static void ASP_TxInterval ( uint32_t param )
{
    phyTimeEvent_t ev;
    
    /* convert interval to symbols */
    ev.timestamp = ((uint64_t)mAsp_TxIntervalMs * 1000) / 16;
    ev.timestamp += PhyTime_GetTimestamp();
    ev.callback = ASP_TxInterval;
    ev.parameter = param;
    mAsp_TxTimer = PhyTime_ScheduleEvent(&ev);
    
    ASP_TelecSendRawData( (uint8_t*)param );
}

/*! *********************************************************************************
* \brief  Generate and load a PRBS9 pattern into Tx buffer
*
********************************************************************************** */
static void ASP_PRBS9_Load (void)
{
#if 1
    FLib_MemCpy((void*)ZLL->PKT_BUFFER_TX, (void*)mAsp_Prbs9Packet, sizeof(mAsp_Prbs9Packet));
#else
    uint8_t c1; /* Byte counter */
    uint8_t c2; /* Bit counter */
    uint16_t t1; /* LFSR */
    uint16_t t2; /* LFSR output */
    uint16_t t3; /* LFSR feedback tap */
    uint8_t t4; /* Assembled transmit byte */
    uint8_t *pTxBuffer = (uint8_t*)ZLL->PKT_BUFFER_TX;
    
    pTxBuffer[0] = 64;
    t1 = 0x01FF; /* Initialize the LFSR */
    for (c1=1; c1<=64; c1++) /* Byte counter */
    {
        t4 = 0x00; /* Initialize the byte */
        for (c2=0; c2<8; c2++) /* Bit counter */
        {
            t2 = (t1 & 0x0001); /* LFSR output */
            if (t2 == 0x0001)
            {
                t4 = t4 | 0x80; /* Set/Clear byte based on LFSR output */
            }
            if (c2 != 7)
            {
                t4 = t4 >> 1; /* LSBit will be first bit out of LFSR */
            }
            t3 = ((t1 & 0x0010u) >> 4u); /* LFSR tap */
            t1 = t1 >> 1; /* Now shift the LFSR */
            if (t2 == t3) /* Set/Clr the LFSR MSBit */
            {
                t1 = t1 & 0xFEFF;
            }
            else
            {
                t1 = t1 | 0x0100;
            }
        }
        pTxBuffer[c1] = t4;
    }
#endif
}

#endif /* gAspCapability_d */